# **`Target Guided Ordinal Encoding`**

In [1]:
import pandas as pd
df = pd.DataFrame({
    'city':['New York',"London","Paris","Tokyo",'New York',"Paris"],
    'price':[200,150,300,250,180,320]
})

In [2]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [5]:
mean_price = df.groupby('city')["price"].mean().to_dict()

In [6]:
 mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [7]:
df["city_encoded"] = df['city'].map(mean_price)

In [9]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

In [12]:
#assignment
import seaborn as sns
df = sns.load_dataset("tips")

In [20]:
#encode time base don total_bill

mean_total_bill = df.groupby('time')['total_bill'].mean().to_dict()

In [21]:
mean_total_bill

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [22]:
df["time_encoded"] = df["time"].map(mean_total_bill)

In [26]:
df[['total_bill',"time_encoded"]]

     total_bill time_encoded
0         16.99    20.797159
1         10.34    20.797159
2         21.01    20.797159
3         23.68    20.797159
4         24.59    20.797159
..          ...          ...
239       29.03    20.797159
240       27.18    20.797159
241       22.67    20.797159
242       17.82    20.797159
243       18.78    20.797159

[244 rows x 2 columns]